var about=["Государство", "Столица", "Континент", "Часть света",  "Разница во времени",  "Денежная единица",  "Географические объекты: ",  "Литературные произведения:","Исторические события:"];

var countries=[
    ["Италия", "Рим", "Евразия", "Европа", -2, "Итальянская лира",
    ["Альпы", "Пальмария", "Апеннинский полуостров", "Комо", "Тальяменто"],
    [["Джованни Верга", "Жизнь среди полей", 1880], ["Анна Виванти", "Цирцея", 1912], ["Джузеппе Понтиджа", "Рождённые дважды", 2000]],
  {"1882":"избирательная реформа", "1945":"антифашистское восстание, 18-28 апреля"}
  ],
  ["Франция", "Париж", "Евразия", "Европа", -1, "Евро",
    ["Эндр", "Пиренеи", "Луара", "Альпы", "Бискайский залив"],
    [["Александр Дюма", "Граф Монте-Кристо", 1845], ["Жюль Габриэль Верн", "Завещание чудака", 1900], ["Луи Анри Буссенар", "Капитан Сорви-голова", 2001], ["Морис Самюэль Роже Шарль Дрюон", "Тисту — мальчик с зелеными пальцами", 1957]],
  {"1572":"Варфоломеевская ночь", "1648":"Вестфальский мир", "1914":"Марнское сражение, 5-12 сентября"}
  ],
  ["Швейцария", "Берн", "Евразия", "Европа", -1, "Швейцарский франк",
    ["Бильское озеро", "Рейхенбахский водопад", "Альпы", "Алечский ледник"],
    [["Иоханна Спири", "Хайди: годы странствий и учёбы", 1880], ["Герман Гессе", "Игра в бисер", 1942], ["Макс Фриш", "Homo Фабер", 1957], ["Мелинда Надь Абонджи", "Голуби взлетают", 2010]],
  {"1291":"основание Швейцарии", "1844":"начало работы первой железнодорожной линией"}
  ],
  ["Венгрия", "Будапешт", "Евразия", "Европа", -1, "Венгерский форинт",
    ["Геллерт", "Карпаты", "Веленце", "Мезёфёльд"],
    [["Янош Бачаньи", "Мужество венгров", 1785], ["Аттила Бартиш", "Спокойствие", 2001], ["Ийеш Дьюла", "Двое мужчин", 1950]],
  {"1222":"подписание Эндре II «Золотой буллы»", "1867":"Коронование Франца-Иосифа в Будапеште по старым обычаям, 8 июня"}
  ],
  ["Румыния", "Бухарест", "Евразия", "Европа", 0, "Румынский лей",
    ["Олт", "Трансильванское плато", "Карпаты", "Медвежья пещера", "Бабеле"],
    [["Михаил Садовяну", "Золотая ветвь", 1933], ["Мирча Элиаде", "Изабель и воды дьявола", 1930]],
  {"1881":"Румыния была провозглашена королевством", "1990":"первые свободные президентские и парламентские выборы", "2004":"Румыния стала членом НАТО"}
  ],
  ["Япония", "Токио", "Евразия", "Азия", +6, "Японская иена",
    ["Фудзияма", "Сакурадзима", "Абукума"],
  [["Сюсаку Эндо", "Море и яд", 1958], ["Юдзо Ямамото", "Профессор Цумура", 1919], ["Марико Хасиока", "Аут", 1997]],
  {"1872":" отменена сложного и строгого сословного деления", "1904":"японский флот атаковал русскую эскадру в Порт-Артуре", "1941":"атака на Пёрл-Харбор"}
  ],
  ["Афганистан", "Кабул", "Евразия", "Азия", +1.5, "Афгани",
    ["Намакзар", "Дашти-Марго", "Фарахруд", "Гиндукуш"],
    [["Гуль Пача Ульфат", "Голос сердца", 1962], ["Абдуррауф Бенава", "Горестные размышления", 1957], ["Махмуд-бек Тарзи", "Путешествия через три континента за 29 дней", 1914]],
  {"1973":"провозглашение Республики, 17 июля", "2004":"новая Конституция и проведены первые президентские выборы"}
  ],
  ["Индия", "Нью-Дели", "Евразия", "Азия", +2.5, "Индийская рупия",
    ["Ганг", "Гуру-Сикар", "Дудхсагар", "Цо-Морари", "Деканские траппы"],
    [["Арундати Рой", "Бог мелочей", 1997], ["Хушвант Сингх", "Поезд в Пакистан", 1956]],
  {"1857":"Восстание Сипаев", "1617":"Британская Ост-Индская компания получила право торговать с Индией", "1948":"Операция «Поло»", "1986":"архитектурное наследие Хампи включено в список Всемирного наследия"}
  ],

  ["Англия", "Лондон", "Евразия", "Европа", -3, "Фунт стерлингов",
    ["Тис", "Белые клифы Дувра", "Саут-Даунс", "Скофелл-Пайк"],
    [["Майн Рида", "Огненная земля", 1883], ["Уильям Шекспир", "Ромео и Джульетта", 1595], ["Оскар Уайльд", "Портрет Дориана Грея", 1891], ["Джонатан Свифт", "Путешествия в некоторые удалённые страны мира в четырёх частях: сочинение Лемюэля Гулливера, сначала хирурга, а затем капитана нескольких кораблей", 1726]],
  {"1701":"Акт о престолонаследии", "1455":"начало войны Алой и Белой розы", "1215":"Великая хартия вольностей"}
  ],

];

var obj1 = {
    countries_obj: countries.slice(0),
    outContries: function(about) {
         let tab ="<div>"
        for(let i = 0; i < this.countries_obj.length; i++){
            tab+="<div>"
            tab +='<table width="85%">';
            tab+="<tr>"
            tab+="<td colspan=2 align=center>"+"<h1>"+  this.countries_obj[i][0] +"-" +this.countries_obj[i][1]  + "</h1>"+"</td>"
            tab+="</tr>"
            for(let k = 2; k < 6; k++){
                tab+="<tr>"
                tab+="<td>" + about[k] + "</td>"
                tab+="<td>" + this.countries_obj[i][k] + "</td>"
                tab+="</tr>";
            }
            for(let k = 6; k < 7; k++){
                tab+="<tr>"
                tab+="<td>" + about[k] + "</td>"
                tab+="<td>"
                let arr = this.countries_obj[i][k].map((num, ii)=>{
                    return "<div>" + (ii+1) + "." + num +"</div>"
                })
                arr = arr.join(" ")
                tab += arr + "</td>"
            }
            for(let k = 7; k < about.length; k++){
               tab+="<tr>"
                if (k < about.length-1 ) {
                    tab+="<td>" + about[k] + "</td>"
                    tab+="<td>"
                    let l = this.countries_obj[i][k].map((num, ii)=>{
                        let p = num.map((n)=>{
                            return n
                        })
                        p = p.join(" ")
                        return "<div>" +(ii+1)+ "." + p +"</div>"
                    })
                    l = l.join(" ")
                    tab += l + "</td>"
                }
                else {
                   tab+="<tr>"
                   tab+="<td td colspan=2 align=center>"+"<b>"+about[k]+"</b>"+"</td>"
                   tab+="</tr>"
                    tab+="<tr>"
                    for (var key in this.countries_obj[i][k]) {
                        tab+="<tr>"
                        tab+="<td>"+key +"-" + this.countries_obj[i][k][key] + "</td>"
                        tab+"</tr>"
                    }
                    tab+="</tr>";
                }
                tab+="</tr>";
            }
         tab+="</table>"
         tab+= "</div>"
        }
        document.getElementById('tabl').innerHTML = tab;
    }
};

function Change(){
    this.countries_obj = [];
    for (i=0; i<countries.length; i++) {
        if (Array.isArray(countries[i]))
        {
            for (j=0; j<countries[i].length; j++)
            {
                if (Array.isArray(countries[i][j]))
                {
                    for (t=0; t<countries[i][j].length; t++){
                        if (Array.isArray(countries[i][j][t]))
                        {
                            if ( t == 0 ) this.countries_obj[i][j] = [];
                            this.countries_obj[i][j][t] = [];
                            this.countries_obj[i][j][t] = countries[i][j][t].slice()
                        }
                        else{
                            if (t == 0 )this.countries_obj[i][j] = [];
                            this.countries_obj[i][j][t] = countries[i][j][t]
                        }
                    }
                }
                else {
                    if (j ==0 )this.countries_obj[i] = [];
                    this.countries_obj[i][j] = countries[i][j];
                }
            }
        }
    };
    this.changeCountries = function(data) {
        this.countries_obj.forEach((country) => {
           if(data==1){
            country[0]=country[0].toUpperCase();
           }
           if(data==0){
               country[0]=country[0].toLowerCase();

           }
        });
    }
};
var obj2 = new Change();

obj1.outContries(about);
